Tekla Open API Reference for Tekla Structures 2025
OBB.IntersectionWith Method (Line)
 Creates an intersection between the OBB and the given Line.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LineSegment IntersectionWith(
	Line line
)
Public Function IntersectionWith (
	line As Line
) As LineSegment
Parameters
line
Type: Tekla.Structures.Geometry3d.Line
Line to calculate against
Return Value
Type: LineSegment
Intersection as LineSegment or null if no intersection was found.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when null is assigned to the line parameter.
See Also
Reference
OBB Class
IntersectionWith Overload
Tekla.Structures.Geometry3d Namespace